public class StartPage {

//        Создать программу, которая логинит пользователя. На стартовом экране запрашиваете логин  пароль.
//        Если логин удачный, переходим на след экран. Если нет, выводим ошибку. Пара логин-пароль хранится в переменных.
//                После удачного логина выводим меню с 5 вариантами задач.  Добавить обработку ошибок.
//                Разложить задачи на методы (плюсом будет разложение на классы).
//                Все запушить в гит отдельным проэктом или папкой и скинуть мне мердж реквестом.
//        1. Even Number
//        2. Armstrong
//        3. Reverse
//        4. Fibonacci
//        5. Replace

    public static void main(String[] args) {

        ProgramCases programCases = new ProgramCases();
        programCases.programCases();

    }
}


